t480s/.local/bin/nfs-client-setup
#!/usr/bin/env bash
# Setup script: nfs-client-setup
# Run on T480s after =tangle-one nfs.org && loom stow:t480s=.
# Safe to re-run when the server relocates or fleet changes.


# [[file:../../../nfs.org::*Setup script: nfs-client-setup][Setup script: nfs-client-setup:1]]
set -euo pipefail

CONF="${HOME}/.local/share/dotcortex/nfs"
HOSTS_FRAG="${CONF}/hosts-nfs.conf"
AUTOFS_MASTER="${CONF}/nfs-direct.autofs"
AUTOFS_DIRECT="${CONF}/auto.direct"
MARKER_START="# BEGIN DOTCORTEX-NFS"
MARKER_END="# END DOTCORTEX-NFS"

die() { printf 'nfs-client-setup: %s\n' "$*" >&2; exit 1; }

[ -f "$HOSTS_FRAG" ]    || die "missing $HOSTS_FRAG — run: tangle-one nfs.org && loom stow:t480s"
[ -f "$AUTOFS_MASTER" ] || die "missing $AUTOFS_MASTER — run: tangle-one nfs.org && loom stow:t480s"
[ -f "$AUTOFS_DIRECT" ] || die "missing $AUTOFS_DIRECT — run: tangle-one nfs.org && loom stow:t480s"

inject_block() {
  local target="$1" src="$2"
  local tmp
  tmp="$(mktemp)"
  if grep -qF "$MARKER_START" "$target" 2>/dev/null; then
    awk "/^${MARKER_START}$/{skip=1} !skip{print} /^${MARKER_END}$/{skip=0}" \
      "$target" > "$tmp"
  else
    cat "$target" > "$tmp" 2>/dev/null || true
  fi
  { printf '\n%s\n' "$MARKER_START"; cat "$src"; printf '%s\n' "$MARKER_END"; } >> "$tmp"
  sudo cp "$tmp" "$target"
  rm -f "$tmp"
}

echo "[1/6] nfs-common + autofs..."
NEED=()
dpkg -s nfs-common &>/dev/null || NEED+=(nfs-common)
dpkg -s autofs     &>/dev/null || NEED+=(autofs)
[ ${#NEED[@]} -eq 0 ] || sudo apt-get install -y "${NEED[@]}"

echo "[2/6] /etc/hosts (server alias)..."
inject_block /etc/hosts "$HOSTS_FRAG"

echo "[3/6] /etc/auto.master.d/..."
sudo install -d -m 755 /etc/auto.master.d
sudo install -m 644 "$AUTOFS_MASTER" /etc/auto.master.d/nfs-direct.autofs

echo "[4/6] /etc/auto.direct..."
sudo touch /etc/auto.direct
inject_block /etc/auto.direct "$AUTOFS_DIRECT"

echo "[5/6] mount point..."
mkdir -p "${HOME}/mnt/x230"

echo "[6/6] autofs..."
sudo service autofs restart

echo
echo "=== T480s NFS client ready ==="
echo "Trigger mount with: ls ${HOME}/mnt/x230"
# Setup script: nfs-client-setup:1 ends here
