x230/.local/bin/nfs-server-setup
#!/usr/bin/env bash
# Setup script: nfs-server-setup
# Run on X230 after =tangle-one nfs.org && loom stow:x230=.
# Safe to re-run whenever the fleet changes.


# [[file:../../../nfs.org::*Setup script: nfs-server-setup][Setup script: nfs-server-setup:1]]
set -euo pipefail

CONF="${HOME}/.local/share/dotcortex/nfs"
HOSTS_FRAG="${CONF}/hosts-nfs.conf"
EXPORTS_FRAG="${CONF}/exports.conf"
MARKER_START="# BEGIN DOTCORTEX-NFS"
MARKER_END="# END DOTCORTEX-NFS"

die() { printf 'nfs-server-setup: %s\n' "$*" >&2; exit 1; }

[ -f "$HOSTS_FRAG" ]   || die "missing $HOSTS_FRAG — run: tangle-one nfs.org && loom stow:x230"
[ -f "$EXPORTS_FRAG" ] || die "missing $EXPORTS_FRAG — run: tangle-one nfs.org && loom stow:x230"

# Idempotent block injection: strips existing DOTCORTEX-NFS block then appends.
inject_block() {
  local target="$1" src="$2"
  local tmp
  tmp="$(mktemp)"
  if grep -qF "$MARKER_START" "$target" 2>/dev/null; then
    awk "/^${MARKER_START}$/{skip=1} !skip{print} /^${MARKER_END}$/{skip=0}" \
      "$target" > "$tmp"
  else
    cat "$target" > "$tmp" 2>/dev/null || true
  fi
  { printf '\n%s\n' "$MARKER_START"; cat "$src"; printf '%s\n' "$MARKER_END"; } >> "$tmp"
  sudo cp "$tmp" "$target"
  rm -f "$tmp"
}

echo "[1/5] nfs-kernel-server..."
dpkg -s nfs-kernel-server &>/dev/null || sudo apt-get install -y nfs-kernel-server

echo "[2/5] /etc/hosts (client aliases)..."
inject_block /etc/hosts "$HOSTS_FRAG"

echo "[3/5] /etc/exports..."
sudo touch /etc/exports
inject_block /etc/exports "$EXPORTS_FRAG"

echo "[4/5] exportfs -ra..."
sudo exportfs -ra
sudo exportfs -v

echo "[5/5] nfs-kernel-server service..."
sudo systemctl enable --now nfs-kernel-server

echo
echo "=== X230 NFS server ready ==="
echo "Active exports:"
sudo exportfs -v
# Setup script: nfs-server-setup:1 ends here
